IDENTIFICATION DIVISION.
PROGRAM-ID. BUBBLE-SORT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-SIZE PIC 9(4) BINARY.
01 ARRAY OCCURS 100 TIMES.
   05 NUMBER PIC 9(4) BINARY.

PROCEDURE DIVISION.
MAIN-LOGIC.
    ACCEPT ARRAY-SIZE
    PERFORM VARYING I FROM 1 BY 1 UNTIL I >= ARRAY-SIZE-1
        PERFORM VARYING J FROM ARRAY-SIZE-1 DOWN TO I+1
            IF NUMBER(J-1) > NUMBER(J)
                MOVE NUMBER(J-1) TO TEMP
                MOVE NUMBER(J) TO NUMBER(J-1)
                MOVE TEMP TO NUMBER(J)
            END-IF
        END-PERFORM
    END-PERFORM
    DISPLAY "Sorted array: "
    PERFORM VARYING I FROM 1 BY 1 UNTIL I >= ARRAY-SIZE
        DISPLAY NUMBER(I)
    END-PERFORM
    STOP RUN.
