IDENTIFICATION DIVISION.
PROGRAM-ID. INTEREST-CALCULATION.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01  PRINCIPAL-AMOUNT PIC 9(7)V99.
   01  INTEREST-RATE    PIC 9(5)V99.
   01  NUMBER-OF-YEARS  PIC 9(2).
   01  INTEREST-AMOUNT  PIC 9(7)V99.

PROCEDURE DIVISION.
   DISPLAY "Enter Principal Amount:".
   ACCEPT PRINCIPAL-AMOUNT.
   DISPLAY "Enter Interest Rate:".
   ACCEPT INTEREST-RATE.
   DISPLAY "Enter Number of Years:".
   ACCEPT NUMBER-OF-YEARS.

   COMPUTE INTEREST-AMOUNT = PRINCIPAL-AMOUNT * 
                             (1 + (INTEREST-RATE / 100)) ** NUMBER-OF-YEARS.

   DISPLAY "Compound Interest is: $" INTEREST-AMOUNT.

   STOP RUN.
