IDENTIFICATION DIVISION.
PROGRAM-ID. PREMIUM-CALCULATION.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT INSURANCE-POLICY ASSIGN TO "INSURANCE-POLICY.DAT".

DATA DIVISION.
FILE SECTION.
FD INSURANCE-POLICY.
01 INSURANCE-RECORD.
   02 POLICY-NUMBER PIC 9(6).
   02 INSURED-NAME PIC X(30).
   02 AGE PIC 9(2).
   02 SMOKER PIC X(1).
   02 PREMIUM PIC 9(5)V99.

WORKING-STORAGE SECTION.
01 WS-SMOKER-FACTOR PIC 9(4)V99 VALUE .20.
01 WS-NON-SMOKER-FACTOR PIC 9(4)V99 VALUE .15.

PROCEDURE DIVISION.
OPEN INPUT INSURANCE-POLICY
   PERFORM UNTIL EOF
      READ INSURANCE-POLICY
      END-READ
      IF SMOKER = "Y"
         MULTIPLY AGE BY WS-SMOKER-FACTOR
         GIVING PREMIUM
      ELSE
         MULTIPLY AGE BY WS-NON-SMOKER-FACTOR
         GIVING PREMIUM
      END-IF
      DISPLAY "POLICY NUMBER: " POLICY-NUMBER
      DISPLAY "INSURED NAME: " INSURED-NAME
      DISPLAY "AGE: " AGE
      DISPLAY "SMOKER: " SMOKER
      DISPLAY "PREMIUM: " PREMIUM
   END-PERFORM
CLOSE INSURANCE-POLICY
STOP RUN.
